; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	infrared3 - mode
	infrared1 - mode
	thermograph0 - mode
	infrared2 - mode
	Star1 - direction
	Star3 - direction
	Star4 - direction
	Star2 - direction
	GroundStation0 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared3)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared1)
	(supports instrument2 infrared3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument3 infrared1)
	(supports instrument3 infrared3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared1)
	(supports instrument4 infrared3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared3)
	(calibration_target instrument5 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
	(supports instrument6 thermograph0)
	(supports instrument6 infrared3)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star3)
	(supports instrument7 infrared1)
	(supports instrument7 infrared3)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star2)
	(supports instrument8 thermograph0)
	(supports instrument8 infrared2)
	(supports instrument8 infrared3)
	(calibration_target instrument8 Star4)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet11)
	(supports instrument9 infrared3)
	(calibration_target instrument9 Star2)
	(supports instrument10 thermograph0)
	(supports instrument10 infrared2)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon5)
)
(:goal (and
	(have_image Phenomenon5 infrared1)
	(have_image Star6 infrared1)
	(have_image Planet7 infrared1)
	(have_image Star8 thermograph0)
	(have_image Phenomenon9 infrared2)
	(have_image Star10 thermograph0)
	(have_image Planet11 infrared1)
	(have_image Star12 infrared2)
	(have_image Star13 infrared2)
	(have_image Planet14 infrared3)
	(have_image Phenomenon15 infrared3)
	(have_image Star16 infrared1)
))

)

; plan
1. (turn_to satellite2 star3 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 star3)
   goals met: 0 of 12
2. (turn_to satellite0 star1 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 star1)
   goals met: 0 of 12
3. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 12
4. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 12
5. (turn_to satellite0 planet7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet7)
   goals met: 0 of 12
6. (take_image satellite0 planet7 instrument2 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 1 of 12
7. (turn_to satellite0 planet14 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet14)
   goals met: 1 of 12
8. (take_image satellite0 planet14 instrument2 infrared3)
   added: (have_image planet14 infrared3)
   goals met: 2 of 12
9. (turn_to satellite0 planet11 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet11)
   goals met: 2 of 12
10. (take_image satellite0 planet11 instrument2 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 3 of 12
11. (turn_to satellite0 phenomenon9 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 12
12. (take_image satellite0 phenomenon9 instrument2 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 4 of 12
13. (turn_to satellite0 phenomenon5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 12
14. (take_image satellite0 phenomenon5 instrument2 infrared1)
   added: (have_image phenomenon5 infrared1)
   goals met: 5 of 12
15. (turn_to satellite0 phenomenon15 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon15)
   goals met: 5 of 12
16. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 5 of 12
17. (calibrate satellite2 instrument6 star3)
   added: (calibrated instrument6)
   goals met: 5 of 12
18. (take_image satellite0 phenomenon15 instrument2 infrared3)
   added: (have_image phenomenon15 infrared3)
   goals met: 6 of 12
19. (turn_to satellite0 star12 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 star12)
   goals met: 6 of 12
20. (take_image satellite0 star12 instrument2 infrared2)
   added: (have_image star12 infrared2)
   goals met: 7 of 12
21. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 7 of 12
22. (take_image satellite0 star13 instrument2 infrared2)
   added: (have_image star13 infrared2)
   goals met: 8 of 12
23. (turn_to satellite0 star16 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star16)
   goals met: 8 of 12
24. (take_image satellite0 star16 instrument2 infrared1)
   added: (have_image star16 infrared1)
   goals met: 9 of 12
25. (turn_to satellite0 star6 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star6)
   goals met: 9 of 12
26. (take_image satellite0 star6 instrument2 infrared1)
   added: (have_image star6 infrared1)
   goals met: 10 of 12
27. (turn_to satellite2 star10 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 star10)
   goals met: 10 of 12
28. (take_image satellite2 star10 instrument6 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 11 of 12
29. (turn_to satellite2 star8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star8)
   goals met: 11 of 12
30. (take_image satellite2 star8 instrument6 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 12 of 12
